---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.op_GreaterThan(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
source: html/eb3c1878-10ee-27a4-42d0-0293fae79655.htm
---
# Autodesk.Revit.DB.WorksetId.op_GreaterThan Method

Determines whether one WorksetId is greater than another WorksetId.

## Syntax (C#)
```csharp
public static bool operator >(
	WorksetId WorksetId1,
	WorksetId WorksetId2
)
```

## Parameters
- **WorksetId1** (`Autodesk.Revit.DB.WorksetId`) - The first WorksetId.
- **WorksetId2** (`Autodesk.Revit.DB.WorksetId`) - The second WorksetId.

## Returns
True if the first WorksetId is greater than the second WorksetId, otherwise, false.